"1 131 1 4206624770 ,"
"input 1 3 300 300 ,"
" 261 264 267 270 273 276 279 282 285 288 291 294 297 302 309 316 319 322 328 329 330 333 336 339 342 345 348 351 354 357 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395 396 397 398 399 400 401 402 403 404 405 406 407 408 418 428 438 448 459 469 479 489 490 500 510 520 530 533 536 539 542 545 548 551 554 557 560 563 566 569 572 575 578 581 584 587 590 593 596 599 602 605 608 611 614 617 620 623 626 629 632 635 boxes input ldmks scores ,"
"boxes scores ldmks ,"
" 130 ,"
"Convolution Conv_0 1 1 input 533 1 3 16 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_1 1 1 533 261 ,"
"Convolution Conv_2 1 1 261 536 16 1 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_3 1 1 536 264 ,"
"Convolution Conv_4 1 1 264 539 1 16 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_5 1 1 539 267 ,"
"Convolution Conv_6 1 1 267 542 32 1 32 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_7 1 1 542 270 ,"
"Convolution Conv_8 1 1 270 545 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_9 1 1 545 273 ,"
"Convolution Conv_10 1 1 273 548 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_11 1 1 548 276 ,"
"Convolution Conv_12 1 1 276 551 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_13 1 1 551 279 ,"
"Convolution Conv_14 1 1 279 554 32 1 32 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_15 1 1 554 282 ,"
"Convolution Conv_16 1 1 282 557 1 32 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_17 1 1 557 285 ,"
"Convolution Conv_18 1 1 285 560 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_19 1 1 560 288 ,"
"Convolution Conv_20 1 1 288 563 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_21 1 1 563 291 ,"
"Convolution Conv_22 1 1 291 566 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_23 1 1 566 294 ,"
"Convolution Conv_24 1 1 294 569 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_25 1 1 569 297 ,"
"Convolution Conv_26 1 1 297 572 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_27 1 1 572 575 1 8 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_28 1 1 575 302 ,"
"Convolution Conv_29 1 1 302 578 1 16 16 3 3 1 1 2 2 1 -1 2 2 ,"
"Convolution Conv_30 1 1 297 581 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_31 1 1 581 584 1 8 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_32 1 1 584 309 ,"
"Convolution Conv_33 1 1 309 587 1 16 16 3 3 1 1 3 3 1 -1 3 3 ,"
"Convolution Conv_34 1 1 297 590 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_35 1 1 590 593 1 8 12 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_36 1 1 593 316 ,"
"Convolution Conv_37 1 1 316 596 1 12 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_38 1 1 596 319 ,"
"Convolution Conv_39 1 1 319 599 1 16 16 3 3 1 1 5 5 1 -1 5 5 ,"
"Concat Concat_40 3 1 578 587 599 322 1 ,"
"Convolution Conv_41 1 1 322 602 1 48 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_42 1 1 297 605 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Mul Mul_44 1 1 602 328 1 ,"
"Add Add_45 2 1 328 605 329 ,"
"ReLU Relu_46 1 1 329 330 ,"
"Convolution Conv_47 1 1 330 608 64 1 64 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_48 1 1 608 333 ,"
"Convolution Conv_49 1 1 333 611 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_50 1 1 611 336 ,"
"Convolution Conv_51 1 1 336 614 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_52 1 1 614 339 ,"
"Convolution Conv_53 1 1 339 617 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_54 1 1 617 342 ,"
"Convolution Conv_55 1 1 342 620 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_56 1 1 620 345 ,"
"Convolution Conv_57 1 1 345 623 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_58 1 1 623 348 ,"
"Convolution Conv_59 1 1 348 626 128 1 128 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_60 1 1 626 351 ,"
"Convolution Conv_61 1 1 351 629 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_62 1 1 629 354 ,"
"Convolution Conv_63 1 1 354 632 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_64 1 1 632 357 ,"
"Convolution Conv_65 1 1 357 635 1 256 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_66 1 1 635 360 ,"
"Convolution Conv_67 1 1 360 361 1 256 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_68 1 1 361 362 ,"
"Convolution Conv_69 1 1 362 363 64 1 64 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_70 1 1 363 364 ,"
"Convolution Conv_71 1 1 364 365 1 64 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_72 1 1 365 366 ,"
"Convolution Conv_73 1 1 330 367 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_74 1 1 367 368 ,"
"Convolution Conv_75 1 1 368 369 1 64 12 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_76 1 1 369 370 4 0 2 3 1 ,"
"Convolution Conv_77 1 1 330 371 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_78 1 1 371 372 ,"
"Convolution Conv_79 1 1 372 373 1 64 6 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_80 1 1 373 374 4 0 2 3 1 ,"
"Convolution Conv_81 1 1 330 375 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_82 1 1 375 376 ,"
"Convolution Conv_83 1 1 376 377 1 64 30 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_84 1 1 377 378 4 0 2 3 1 ,"
"Convolution Conv_85 1 1 348 379 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_86 1 1 379 380 ,"
"Convolution Conv_87 1 1 380 381 1 128 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_88 1 1 381 382 4 0 2 3 1 ,"
"Convolution Conv_89 1 1 348 383 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_90 1 1 383 384 ,"
"Convolution Conv_91 1 1 384 385 1 128 4 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_92 1 1 385 386 4 0 2 3 1 ,"
"Convolution Conv_93 1 1 348 387 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_94 1 1 387 388 ,"
"Convolution Conv_95 1 1 388 389 1 128 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_96 1 1 389 390 4 0 2 3 1 ,"
"Convolution Conv_97 1 1 360 391 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_98 1 1 391 392 ,"
"Convolution Conv_99 1 1 392 393 1 256 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_100 1 1 393 394 4 0 2 3 1 ,"
"Convolution Conv_101 1 1 360 395 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_102 1 1 395 396 ,"
"Convolution Conv_103 1 1 396 397 1 256 4 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_104 1 1 397 398 4 0 2 3 1 ,"
"Convolution Conv_105 1 1 360 399 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_106 1 1 399 400 ,"
"Convolution Conv_107 1 1 400 401 1 256 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_108 1 1 401 402 4 0 2 3 1 ,"
"Convolution Conv_109 1 1 366 403 1 256 12 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_110 1 1 403 404 4 0 2 3 1 ,"
"Convolution Conv_111 1 1 366 405 1 256 6 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_112 1 1 405 406 4 0 2 3 1 ,"
"Convolution Conv_113 1 1 366 407 1 256 30 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_114 1 1 407 408 4 0 2 3 1 ,"
"Reshape Reshape_120 1 1 370 418 0 4 4 0 -1 4 1 ,"
"Reshape Reshape_126 1 1 382 428 0 4 4 0 -1 4 1 ,"
"Reshape Reshape_132 1 1 394 438 0 4 4 0 -1 4 1 ,"
"Reshape Reshape_138 1 1 404 448 0 4 4 0 -1 4 1 ,"
"Concat Concat_139 4 1 418 428 438 448 boxes 1 ,"
"Reshape Reshape_145 1 1 374 459 0 4 4 0 -1 2 1 ,"
"Reshape Reshape_151 1 1 386 469 0 4 4 0 -1 2 1 ,"
"Reshape Reshape_157 1 1 398 479 0 4 4 0 -1 2 1 ,"
"Reshape Reshape_163 1 1 406 489 0 4 4 0 -1 2 1 ,"
"Concat Concat_164 4 1 459 469 479 489 490 1 ,"
"Reshape Reshape_170 1 1 378 500 0 4 4 0 -1 10 1 ,"
"Reshape Reshape_176 1 1 390 510 0 4 4 0 -1 10 1 ,"
"Reshape Reshape_182 1 1 402 520 0 4 4 0 -1 10 1 ,"
"Reshape Reshape_188 1 1 408 530 0 4 4 0 -1 10 1 ,"
"Concat Concat_189 4 1 500 510 520 530 ldmks 1 ,"
"SoftmaxCaffe Softmax_190 1 1 490 scores 2 ,"
