7767517
137 151
Input            input                    0 1 input
MemoryData       327                      0 1 327 0=1
Convolution      Conv_0                   1 1 input 533 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
ReLU             Relu_1                   1 1 533 261
ConvolutionDepthWise Conv_2                   1 1 261 536 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             Relu_3                   1 1 536 264
Convolution      Conv_4                   1 1 264 539 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             Relu_5                   1 1 539 267
ConvolutionDepthWise Conv_6                   1 1 267 542 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             Relu_7                   1 1 542 270
Convolution      Conv_8                   1 1 270 545 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             Relu_9                   1 1 545 273
ConvolutionDepthWise Conv_10                  1 1 273 548 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             Relu_11                  1 1 548 276
Convolution      Conv_12                  1 1 276 551 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             Relu_13                  1 1 551 279
ConvolutionDepthWise Conv_14                  1 1 279 554 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             Relu_15                  1 1 554 282
Convolution      Conv_16                  1 1 282 557 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             Relu_17                  1 1 557 285
ConvolutionDepthWise Conv_18                  1 1 285 560 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_19                  1 1 560 288
Convolution      Conv_20                  1 1 288 563 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_21                  1 1 563 291
ConvolutionDepthWise Conv_22                  1 1 291 566 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_23                  1 1 566 294
Convolution      Conv_24                  1 1 294 569 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             Relu_25                  1 1 569 297
Split            splitncnn_0              1 4 297 297_splitncnn_0 297_splitncnn_1 297_splitncnn_2 297_splitncnn_3
Convolution      Conv_26                  1 1 297_splitncnn_3 572 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_27                  1 1 572 575 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152
ReLU             Relu_28                  1 1 575 302
Convolution      Conv_29                  1 1 302 578 0=16 1=3 11=3 2=2 12=2 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2304
Convolution      Conv_30                  1 1 297_splitncnn_2 581 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_31                  1 1 581 584 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152
ReLU             Relu_32                  1 1 584 309
Convolution      Conv_33                  1 1 309 587 0=16 1=3 11=3 2=3 12=3 3=1 13=1 4=3 14=3 15=3 16=3 5=1 6=2304
Convolution      Conv_34                  1 1 297_splitncnn_1 590 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_35                  1 1 590 593 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864
ReLU             Relu_36                  1 1 593 316
Convolution      Conv_37                  1 1 316 596 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728
ReLU             Relu_38                  1 1 596 319
Convolution      Conv_39                  1 1 319 599 0=16 1=3 11=3 2=5 12=5 3=1 13=1 4=5 14=5 15=5 16=5 5=1 6=2304
Concat           Concat_40                3 1 578 587 599 322 0=0
Convolution      Conv_41                  1 1 322 602 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Convolution      Conv_42                  1 1 297_splitncnn_0 605 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
BinaryOp         Mul_44                   2 1 602 327 328 0=2
BinaryOp         Add_45                   2 1 328 605 329 0=0
ReLU             Relu_46                  1 1 329 330
Split            splitncnn_1              1 4 330 330_splitncnn_0 330_splitncnn_1 330_splitncnn_2 330_splitncnn_3
ConvolutionDepthWise Conv_47                  1 1 330_splitncnn_3 331 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_48                  1 1 331 332
Convolution      Conv_49                  1 1 332 333 0=6 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=384
Permute          Transpose_50             1 1 333 334 0=3
Reshape          Reshape_56               1 1 334 344 0=2 1=-1
ConvolutionDepthWise Conv_57                  1 1 330_splitncnn_2 345 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_58                  1 1 345 346
Convolution      Conv_59                  1 1 346 347 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
Permute          Transpose_60             1 1 347 348 0=3
Reshape          Reshape_66               1 1 348 358 0=4 1=-1
ConvolutionDepthWise Conv_67                  1 1 330_splitncnn_1 359 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_68                  1 1 359 360
Convolution      Conv_69                  1 1 360 361 0=30 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1920
Permute          Transpose_70             1 1 361 362 0=3
Reshape          Reshape_76               1 1 362 372 0=10 1=-1
ConvolutionDepthWise Conv_77                  1 1 330_splitncnn_0 608 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_78                  1 1 608 375
Convolution      Conv_79                  1 1 375 611 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             Relu_80                  1 1 611 378
ConvolutionDepthWise Conv_81                  1 1 378 614 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_82                  1 1 614 381
Convolution      Conv_83                  1 1 381 617 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             Relu_84                  1 1 617 384
ConvolutionDepthWise Conv_85                  1 1 384 620 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_86                  1 1 620 387
Convolution      Conv_87                  1 1 387 623 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             Relu_88                  1 1 623 390
Split            splitncnn_2              1 4 390 390_splitncnn_0 390_splitncnn_1 390_splitncnn_2 390_splitncnn_3
ConvolutionDepthWise Conv_89                  1 1 390_splitncnn_3 391 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_90                  1 1 391 392
Convolution      Conv_91                  1 1 392 393 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          Transpose_92             1 1 393 394 0=3
Reshape          Reshape_98               1 1 394 404 0=2 1=-1
ConvolutionDepthWise Conv_99                  1 1 390_splitncnn_2 405 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_100                 1 1 405 406
Convolution      Conv_101                 1 1 406 407 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Permute          Transpose_102            1 1 407 408 0=3
Reshape          Reshape_108              1 1 408 418 0=4 1=-1
ConvolutionDepthWise Conv_109                 1 1 390_splitncnn_1 419 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_110                 1 1 419 420
Convolution      Conv_111                 1 1 420 421 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2560
Permute          Transpose_112            1 1 421 422 0=3
Reshape          Reshape_118              1 1 422 432 0=10 1=-1
ConvolutionDepthWise Conv_119                 1 1 390_splitncnn_0 626 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             Relu_120                 1 1 626 435
Convolution      Conv_121                 1 1 435 629 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             Relu_122                 1 1 629 438
ConvolutionDepthWise Conv_123                 1 1 438 632 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             Relu_124                 1 1 632 441
Convolution      Conv_125                 1 1 441 635 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             Relu_126                 1 1 635 444
Split            splitncnn_3              1 4 444 444_splitncnn_0 444_splitncnn_1 444_splitncnn_2 444_splitncnn_3
ConvolutionDepthWise Conv_127                 1 1 444_splitncnn_3 445 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             Relu_128                 1 1 445 446
Convolution      Conv_129                 1 1 446 447 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Permute          Transpose_130            1 1 447 448 0=3
Reshape          Reshape_136              1 1 448 458 0=2 1=-1
ConvolutionDepthWise Conv_137                 1 1 444_splitncnn_2 459 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             Relu_138                 1 1 459 460
Convolution      Conv_139                 1 1 460 461 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Permute          Transpose_140            1 1 461 462 0=3
Reshape          Reshape_146              1 1 462 472 0=4 1=-1
ConvolutionDepthWise Conv_147                 1 1 444_splitncnn_1 473 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             Relu_148                 1 1 473 474
Convolution      Conv_149                 1 1 474 475 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5120
Permute          Transpose_150            1 1 475 476 0=3
Reshape          Reshape_156              1 1 476 486 0=10 1=-1
Convolution      Conv_157                 1 1 444_splitncnn_0 487 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             Relu_158                 1 1 487 488
ConvolutionDepthWise Conv_159                 1 1 488 489 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_160                 1 1 489 490
Convolution      Conv_161                 1 1 490 491 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             Relu_162                 1 1 491 492
Split            splitncnn_4              1 3 492 492_splitncnn_0 492_splitncnn_1 492_splitncnn_2
Convolution      Conv_163                 1 1 492_splitncnn_2 493 0=6 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=13824
Permute          Transpose_164            1 1 493 494 0=3
Reshape          Reshape_170              1 1 494 504 0=2 1=-1
Convolution      Conv_171                 1 1 492_splitncnn_1 505 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=27648
Permute          Transpose_172            1 1 505 506 0=3
Reshape          Reshape_178              1 1 506 516 0=4 1=-1
Convolution      Conv_179                 1 1 492_splitncnn_0 517 0=30 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=69120
Permute          Transpose_180            1 1 517 518 0=3
Reshape          Reshape_186              1 1 518 528 0=10 1=-1
Concat           Concat_187               4 1 344 404 458 504 529 0=0
Concat           Concat_188               4 1 358 418 472 516 boxes 0=0
Concat           Concat_189               4 1 372 432 486 528 ldmks 0=0
Softmax          Softmax_190              1 1 529 scores 0=1 1=1
