"1 105 1 4206624770 ,"
"input 1 3 256 256 ,"
" 335 338 343 346 351 354 357 360 363 368 371 374 377 380 383 386 389 394 397 400 403 406 409 412 415 418 421 424 429 432 435 438 441 444 447 450 455 458 461 464 467 470 473 476 481 483 484 486 487 489 490 492 495 498 501 504 507 510 513 516 519 522 525 528 531 534 537 540 543 546 549 552 555 558 561 564 567 570 573 576 579 582 585 588 591 594 597 600 603 606 609 612 615 618 621 624 627 630 633 636 639 642 645 input output ,"
"output ,"
" 104 ,"
"Convolution Conv_0 1 1 input 492 1 3 16 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_1 1 1 492 335 ,"
"Convolution Conv_2 1 1 335 495 16 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_3 1 1 495 338 ,"
"Convolution Conv_4 1 1 338 498 1 16 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_5 1 1 498 501 1 8 48 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_6 1 1 501 343 ,"
"Convolution Conv_7 1 1 343 504 48 48 48 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_8 1 1 504 346 ,"
"Convolution Conv_9 1 1 346 507 1 48 12 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_10 1 1 507 510 1 12 72 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_11 1 1 510 351 ,"
"Convolution Conv_12 1 1 351 513 72 72 72 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_13 1 1 513 354 ,"
"Convolution Conv_14 1 1 354 516 1 72 12 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_15 2 1 507 516 357 ,"
"Convolution Conv_16 1 1 357 519 1 12 72 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_17 1 1 519 360 ,"
"Convolution Conv_18 1 1 360 522 72 72 72 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_19 1 1 522 363 ,"
"Convolution Conv_20 1 1 363 525 1 72 16 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_21 1 1 525 528 1 16 96 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_22 1 1 528 368 ,"
"Convolution Conv_23 1 1 368 531 96 96 96 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_24 1 1 531 371 ,"
"Convolution Conv_25 1 1 371 534 1 96 16 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_26 2 1 525 534 374 ,"
"Convolution Conv_27 1 1 374 537 1 16 96 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_28 1 1 537 377 ,"
"Convolution Conv_29 1 1 377 540 96 96 96 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_30 1 1 540 380 ,"
"Convolution Conv_31 1 1 380 543 1 96 16 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_32 2 1 374 543 383 ,"
"Convolution Conv_33 1 1 383 546 1 16 96 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_34 1 1 546 386 ,"
"Convolution Conv_35 1 1 386 549 96 96 96 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_36 1 1 549 389 ,"
"Convolution Conv_37 1 1 389 552 1 96 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_38 1 1 552 555 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_39 1 1 555 394 ,"
"Convolution Conv_40 1 1 394 558 192 192 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_41 1 1 558 397 ,"
"Convolution Conv_42 1 1 397 561 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_43 2 1 552 561 400 ,"
"Convolution Conv_44 1 1 400 564 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_45 1 1 564 403 ,"
"Convolution Conv_46 1 1 403 567 192 192 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_47 1 1 567 406 ,"
"Convolution Conv_48 1 1 406 570 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_49 2 1 400 570 409 ,"
"Convolution Conv_50 1 1 409 573 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_51 1 1 573 412 ,"
"Convolution Conv_52 1 1 412 576 192 192 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_53 1 1 576 415 ,"
"Convolution Conv_54 1 1 415 579 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_55 2 1 409 579 418 ,"
"Convolution Conv_56 1 1 418 582 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_57 1 1 582 421 ,"
"Convolution Conv_58 1 1 421 585 192 192 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_59 1 1 585 424 ,"
"Convolution Conv_60 1 1 424 588 1 192 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_61 1 1 588 591 1 48 288 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_62 1 1 591 429 ,"
"Convolution Conv_63 1 1 429 594 288 288 288 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_64 1 1 594 432 ,"
"Convolution Conv_65 1 1 432 597 1 288 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_66 2 1 588 597 435 ,"
"Convolution Conv_67 1 1 435 600 1 48 288 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_68 1 1 600 438 ,"
"Convolution Conv_69 1 1 438 603 288 288 288 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_70 1 1 603 441 ,"
"Convolution Conv_71 1 1 441 606 1 288 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_72 2 1 435 606 444 ,"
"Convolution Conv_73 1 1 444 609 1 48 288 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_74 1 1 609 447 ,"
"Convolution Conv_75 1 1 447 612 288 288 288 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_76 1 1 612 450 ,"
"Convolution Conv_77 1 1 450 615 1 288 80 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_78 1 1 615 618 1 80 480 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_79 1 1 618 455 ,"
"Convolution Conv_80 1 1 455 621 480 480 480 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_81 1 1 621 458 ,"
"Convolution Conv_82 1 1 458 624 1 480 80 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_83 2 1 615 624 461 ,"
"Convolution Conv_84 1 1 461 627 1 80 480 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_85 1 1 627 464 ,"
"Convolution Conv_86 1 1 464 630 480 480 480 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_87 1 1 630 467 ,"
"Convolution Conv_88 1 1 467 633 1 480 80 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_89 2 1 461 633 470 ,"
"Convolution Conv_90 1 1 470 636 1 80 480 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_91 1 1 636 473 ,"
"Convolution Conv_92 1 1 473 639 480 480 480 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_93 1 1 639 476 ,"
"Convolution Conv_94 1 1 476 642 1 480 160 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_95 1 1 642 645 1 160 640 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_96 1 1 645 481 ,"
"Deconvolution ConvTranspose_97 1 1 481 483 1 640 8 4 4 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_99 1 1 483 484 ,"
"Deconvolution ConvTranspose_100 1 1 484 486 1 8 8 4 4 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_102 1 1 486 487 ,"
"Deconvolution ConvTranspose_103 1 1 487 489 1 8 8 4 4 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_105 1 1 489 490 ,"
"Convolution Conv_106 1 1 490 output 1 8 4 1 1 1 1 0 0 1 -1 1 1 ,"
