"1 103 1 4206624770 ,"
"input 1 3 256 320 ,"
" 329 332 337 340 345 348 351 354 357 362 365 368 371 374 377 380 383 388 391 394 397 400 403 406 409 412 415 418 423 426 429 432 435 438 441 444 449 452 455 458 461 464 467 470 474 475 477 478 480 481 483 486 489 492 495 498 501 504 507 510 513 516 519 522 525 528 531 534 537 540 543 546 549 552 555 558 561 564 567 570 573 576 579 582 585 588 591 594 597 600 603 606 609 612 615 618 621 624 627 630 633 input output ,"
"output ,"
" 102 ,"
"Convolution Conv_0 1 1 input 483 1 3 14 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_1 1 1 483 329 ,"
"Convolution Conv_2 1 1 329 486 14 1 14 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_3 1 1 486 332 ,"
"Convolution Conv_4 1 1 332 489 1 14 7 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_5 1 1 489 492 1 7 42 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_6 1 1 492 337 ,"
"Convolution Conv_7 1 1 337 495 42 1 42 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_8 1 1 495 340 ,"
"Convolution Conv_9 1 1 340 498 1 42 10 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_10 1 1 498 501 1 10 60 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_11 1 1 501 345 ,"
"Convolution Conv_12 1 1 345 504 60 1 60 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_13 1 1 504 348 ,"
"Convolution Conv_14 1 1 348 507 1 60 10 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_15 2 1 498 507 351 ,"
"Convolution Conv_16 1 1 351 510 1 10 60 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_17 1 1 510 354 ,"
"Convolution Conv_18 1 1 354 513 60 1 60 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_19 1 1 513 357 ,"
"Convolution Conv_20 1 1 357 516 1 60 14 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_21 1 1 516 519 1 14 84 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_22 1 1 519 362 ,"
"Convolution Conv_23 1 1 362 522 84 1 84 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_24 1 1 522 365 ,"
"Convolution Conv_25 1 1 365 525 1 84 14 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_26 2 1 516 525 368 ,"
"Convolution Conv_27 1 1 368 528 1 14 84 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_28 1 1 528 371 ,"
"Convolution Conv_29 1 1 371 531 84 1 84 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_30 1 1 531 374 ,"
"Convolution Conv_31 1 1 374 534 1 84 14 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_32 2 1 368 534 377 ,"
"Convolution Conv_33 1 1 377 537 1 14 84 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_34 1 1 537 380 ,"
"Convolution Conv_35 1 1 380 540 84 1 84 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_36 1 1 540 383 ,"
"Convolution Conv_37 1 1 383 543 1 84 28 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_38 1 1 543 546 1 28 168 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_39 1 1 546 388 ,"
"Convolution Conv_40 1 1 388 549 168 1 168 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_41 1 1 549 391 ,"
"Convolution Conv_42 1 1 391 552 1 168 28 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_43 2 1 543 552 394 ,"
"Convolution Conv_44 1 1 394 555 1 28 168 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_45 1 1 555 397 ,"
"Convolution Conv_46 1 1 397 558 168 1 168 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_47 1 1 558 400 ,"
"Convolution Conv_48 1 1 400 561 1 168 28 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_49 2 1 394 561 403 ,"
"Convolution Conv_50 1 1 403 564 1 28 168 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_51 1 1 564 406 ,"
"Convolution Conv_52 1 1 406 567 168 1 168 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_53 1 1 567 409 ,"
"Convolution Conv_54 1 1 409 570 1 168 28 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_55 2 1 403 570 412 ,"
"Convolution Conv_56 1 1 412 573 1 28 168 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_57 1 1 573 415 ,"
"Convolution Conv_58 1 1 415 576 168 1 168 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_59 1 1 576 418 ,"
"Convolution Conv_60 1 1 418 579 1 168 43 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_61 1 1 579 582 1 43 258 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_62 1 1 582 423 ,"
"Convolution Conv_63 1 1 423 585 258 1 258 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_64 1 1 585 426 ,"
"Convolution Conv_65 1 1 426 588 1 258 43 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_66 2 1 579 588 429 ,"
"Convolution Conv_67 1 1 429 591 1 43 258 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_68 1 1 591 432 ,"
"Convolution Conv_69 1 1 432 594 258 1 258 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_70 1 1 594 435 ,"
"Convolution Conv_71 1 1 435 597 1 258 43 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_72 2 1 429 597 438 ,"
"Convolution Conv_73 1 1 438 600 1 43 258 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_74 1 1 600 441 ,"
"Convolution Conv_75 1 1 441 603 258 1 258 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_76 1 1 603 444 ,"
"Convolution Conv_77 1 1 444 606 1 258 72 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_78 1 1 606 609 1 72 432 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_79 1 1 609 449 ,"
"Convolution Conv_80 1 1 449 612 432 1 432 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_81 1 1 612 452 ,"
"Convolution Conv_82 1 1 452 615 1 432 72 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_83 2 1 606 615 455 ,"
"Convolution Conv_84 1 1 455 618 1 72 432 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_85 1 1 618 458 ,"
"Convolution Conv_86 1 1 458 621 432 1 432 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_87 1 1 621 461 ,"
"Convolution Conv_88 1 1 461 624 1 432 72 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_89 2 1 455 624 464 ,"
"Convolution Conv_90 1 1 464 627 1 72 432 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_91 1 1 627 467 ,"
"Convolution Conv_92 1 1 467 630 432 1 432 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_93 1 1 630 470 ,"
"Convolution Conv_94 1 1 470 633 1 432 144 1 1 1 1 0 0 1 -1 1 1 ,"
"Deconvolution ConvTranspose_95 1 1 633 474 1 144 16 4 4 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_97 1 1 474 475 ,"
"Deconvolution ConvTranspose_98 1 1 475 477 1 16 16 4 4 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_100 1 1 477 478 ,"
"Deconvolution ConvTranspose_101 1 1 478 480 1 16 16 4 4 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_103 1 1 480 481 ,"
"Convolution Conv_104 1 1 481 output 1 16 4 1 1 1 1 0 0 1 -1 1 1 ,"
