"1 102 1 4206624770 ,"
"input 1 3 112 112 ,"
" 358 362 368 372 378 382 385 389 393 399 403 406 410 414 417 421 425 431 435 438 442 446 449 453 457 460 464 468 474 478 481 485 489 492 496 500 506 510 513 517 521 524 528 532 538 539 540 541 543 546 549 552 555 558 561 564 567 570 573 576 579 582 585 588 591 594 597 600 603 606 609 612 615 618 621 624 627 630 633 636 639 642 645 648 651 654 657 660 663 666 669 672 675 678 681 684 687 690 693 696 input output ,"
"output ,"
" 101 ,"
"Convolution Conv_0 1 1 input 543 1 3 32 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_1 1 1 543 358 0 0 ,"
"Convolution Conv_2 1 1 358 546 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_3 1 1 546 362 0 0 ,"
"Convolution Conv_4 1 1 362 549 1 32 16 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_5 1 1 549 552 1 16 96 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_6 1 1 552 368 0 0 ,"
"Convolution Conv_7 1 1 368 555 96 1 96 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_8 1 1 555 372 0 0 ,"
"Convolution Conv_9 1 1 372 558 1 96 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_10 1 1 558 561 1 24 144 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_11 1 1 561 378 0 0 ,"
"Convolution Conv_12 1 1 378 564 144 1 144 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_13 1 1 564 382 0 0 ,"
"Convolution Conv_14 1 1 382 567 1 144 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_15 2 1 558 567 385 ,"
"Convolution Conv_16 1 1 385 570 1 24 144 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_17 1 1 570 389 0 0 ,"
"Convolution Conv_18 1 1 389 573 144 1 144 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_19 1 1 573 393 0 0 ,"
"Convolution Conv_20 1 1 393 576 1 144 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_21 1 1 576 579 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_22 1 1 579 399 0 0 ,"
"Convolution Conv_23 1 1 399 582 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_24 1 1 582 403 0 0 ,"
"Convolution Conv_25 1 1 403 585 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_26 2 1 576 585 406 ,"
"Convolution Conv_27 1 1 406 588 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_28 1 1 588 410 0 0 ,"
"Convolution Conv_29 1 1 410 591 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_30 1 1 591 414 0 0 ,"
"Convolution Conv_31 1 1 414 594 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_32 2 1 406 594 417 ,"
"Convolution Conv_33 1 1 417 597 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_34 1 1 597 421 0 0 ,"
"Convolution Conv_35 1 1 421 600 192 1 192 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_36 1 1 600 425 0 0 ,"
"Convolution Conv_37 1 1 425 603 1 192 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_38 1 1 603 606 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_39 1 1 606 431 0 0 ,"
"Convolution Conv_40 1 1 431 609 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_41 1 1 609 435 0 0 ,"
"Convolution Conv_42 1 1 435 612 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_43 2 1 603 612 438 ,"
"Convolution Conv_44 1 1 438 615 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_45 1 1 615 442 0 0 ,"
"Convolution Conv_46 1 1 442 618 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_47 1 1 618 446 0 0 ,"
"Convolution Conv_48 1 1 446 621 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_49 2 1 438 621 449 ,"
"Convolution Conv_50 1 1 449 624 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_51 1 1 624 453 0 0 ,"
"Convolution Conv_52 1 1 453 627 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_53 1 1 627 457 0 0 ,"
"Convolution Conv_54 1 1 457 630 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_55 2 1 449 630 460 ,"
"Convolution Conv_56 1 1 460 633 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_57 1 1 633 464 0 0 ,"
"Convolution Conv_58 1 1 464 636 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_59 1 1 636 468 0 0 ,"
"Convolution Conv_60 1 1 468 639 1 384 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_61 1 1 639 642 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_62 1 1 642 474 0 0 ,"
"Convolution Conv_63 1 1 474 645 576 1 576 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_64 1 1 645 478 0 0 ,"
"Convolution Conv_65 1 1 478 648 1 576 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_66 2 1 639 648 481 ,"
"Convolution Conv_67 1 1 481 651 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_68 1 1 651 485 0 0 ,"
"Convolution Conv_69 1 1 485 654 576 1 576 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_70 1 1 654 489 0 0 ,"
"Convolution Conv_71 1 1 489 657 1 576 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_72 2 1 481 657 492 ,"
"Convolution Conv_73 1 1 492 660 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_74 1 1 660 496 0 0 ,"
"Convolution Conv_75 1 1 496 663 576 1 576 3 3 2 2 1 1 1 -1 1 1 ,"
"PReLU PRelu_76 1 1 663 500 0 0 ,"
"Convolution Conv_77 1 1 500 666 1 576 160 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_78 1 1 666 669 1 160 960 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_79 1 1 669 506 0 0 ,"
"Convolution Conv_80 1 1 506 672 960 1 960 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_81 1 1 672 510 0 0 ,"
"Convolution Conv_82 1 1 510 675 1 960 160 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_83 2 1 666 675 513 ,"
"Convolution Conv_84 1 1 513 678 1 160 960 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_85 1 1 678 517 0 0 ,"
"Convolution Conv_86 1 1 517 681 960 1 960 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_87 1 1 681 521 0 0 ,"
"Convolution Conv_88 1 1 521 684 1 960 160 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_89 2 1 513 684 524 ,"
"Convolution Conv_90 1 1 524 687 1 160 960 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_91 1 1 687 528 0 0 ,"
"Convolution Conv_92 1 1 528 690 960 1 960 3 3 1 1 1 1 1 -1 1 1 ,"
"PReLU PRelu_93 1 1 690 532 0 0 ,"
"Convolution Conv_94 1 1 532 693 1 960 320 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_95 1 1 693 696 1 320 1280 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_96 1 1 696 538 0 0 ,"
"ReduceMean ReduceMean_97 1 1 538 539 0 3 ,"
"ReduceMean ReduceMean_98 1 1 539 540 0 2 ,"
"InnerProduct Gemm_99 1 1 540 541 512 1 0 1 ,"
"BatchNormCxx BatchNormalization_100 1 1 541 output ,"
